Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP16GS504.h
#define DCMP2LO DCMP2LO
extern volatile unsigned int  DCMP2LO __attribute__((__sfr__));
#define DCMP2HI DCMP2HI
extern volatile unsigned int  DCMP2HI __attribute__((__sfr__));
#define ADFLTR1DAT ADFLTR1DAT
extern volatile unsigned int  ADFLTR1DAT __attribute__((__sfr__));
#define ADFLTR1CON ADFLTR1CON
extern volatile unsigned int  ADFLTR1CON __attribute__((__sfr__));
__extension__ typedef struct tagADFLTR1CONBITS {
  union {
    struct {
      unsigned CHNLID:6;
      unsigned :2;
      unsigned AFRDY:1;
      unsigned AFGIEN:1;
      unsigned OVRSAM:3;
      unsigned :2;
      unsigned AFEN:1;
    };
    struct {
      unsigned CHNLID0:1;
      unsigned CHNLID1:1;
      unsigned CHNLID2:1;
      unsigned CHNLID3:1;
      unsigned CHNLID4:1;
      unsigned CHNLID5:1;
      unsigned :4;
      unsigned OVRSAM0:1;
      unsigned OVRSAM1:1;
      unsigned OVRSAM2:1;
    };
  };
} ADFLTR1CONBITS;
extern volatile ADFLTR1CONBITS ADFLTR1CONbits __attribute__((__sfr__));

#define ADFLTR2DAT ADFLTR2DAT
extern volatile unsigned int  ADFLTR2DAT __attribute__((__sfr__));
#define ADFLTR2CON ADFLTR2CON
extern volatile unsigned int  ADFLTR2CON __attribute__((__sfr__));
__extension__ typedef struct tagADFLTR2CONBITS {
  union {
    struct {
      unsigned CHNLID:6;
      unsigned :2;
      unsigned AFRDY:1;
      unsigned AFGIEN:1;
      unsigned OVRSAM:3;
      unsigned :2;
      unsigned AFEN:1;
    };
    struct {
      unsigned CHNLID0:1;
      unsigned CHNLID1:1;
      unsigned CHNLID2:1;
      unsigned CHNLID3:1;
      unsigned CHNLID4:1;
      unsigned CHNLID5:1;
      unsigned :4;
      unsigned OVRSAM0:1;
      unsigned OVRSAM1:1;
      unsigned OVRSAM2:1;
    };
  };
} ADFLTR2CONBITS;
extern volatile ADFLTR2CONBITS ADFLTR2CONbits __attribute__((__sfr__));

#define ADTRIG1 ADTRIG1
extern volatile unsigned int  ADTRIG1 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG1BITS {
  union {
    struct {
      unsigned TRGSRC0:5;
      unsigned :3;
      unsigned TRGSRC1:5;
    };
    struct {
      unsigned TRGSRC00:1;
      unsigned TRGSRC01:1;
      unsigned TRGSRC02:1;
      unsigned TRGSRC03:1;
      unsigned TRGSRC04:1;
      unsigned :3;
      unsigned TRGSRC10:1;
      unsigned TRGSRC11:1;
      unsigned TRGSRC12:1;
      unsigned TRGSRC13:1;
      unsigned TRGSRC14:1;
    };
  };
} ADTRIG1BITS;
extern volatile ADTRIG1BITS ADTRIG1bits __attribute__((__sfr__));

#define ADTRIG2 ADTRIG2
extern volatile unsigned int  ADTRIG2 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG2BITS {
  union {
    struct {
      unsigned TRGSRC2:5;
      unsigned :3;
      unsigned TRGSRC3:5;
    };
    struct {
      unsigned TRGSRC20:1;
      unsigned TRGSRC21:1;
      unsigned TRGSRC22:1;
      unsigned TRGSRC23:1;
      unsigned TRGSRC24:1;
      unsigned :3;
      unsigned TRGSRC30:1;
      unsigned TRGSRC31:1;
      unsigned TRGSRC32:1;
      unsigned TRGSRC33:1;
      unsigned TRGSRC34:1;
    };
  };
} ADTRIG2BITS;
extern volatile ADTRIG2BITS ADTRIG2bits __attribute__((__sfr__));

#define ADTRIG3 ADTRIG3
extern volatile unsigned int  ADTRIG3 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG3BITS {
  union {
    struct {
      unsigned TRGSRC4:5;
      unsigned :3;
      unsigned TRGSRC5:5;
    };
    struct {
      unsigned TRGSRC40:1;
      unsigned TRGSRC41:1;
      unsigned TRGSRC42:1;
      unsigned TRGSRC43:1;
      unsigned TRGSRC44:1;
      unsigned :3;
      unsigned TRGSRC50:1;
      unsigned TRGSRC51:1;
      unsigned TRGSRC52:1;
      unsigned TRGSRC53:1;
      unsigned TRGSRC54:1;
    };
  };
} ADTRIG3BITS;
extern volatile ADTRIG3BITS ADTRIG3bits __attribute__((__sfr__));

#define ADTRIG4 ADTRIG4
extern volatile unsigned int  ADTRIG4 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG4BITS {
  union {
    struct {
      unsigned TRGSRC6:5;
      unsigned :3;
      unsigned TRGSRC7:5;
    };
    struct {
      unsigned TRGSRC60:1;
      unsigned TRGSRC61:1;
      unsigned TRGSRC62:1;
      unsigned TRGSRC63:1;
      unsigned TRGSRC64:1;
      unsigned :3;
      unsigned TRGSRC70:1;
      unsigned TRGSRC71:1;
      unsigned TRGSRC72:1;
      unsigned TRGSRC73:1;
      unsigned TRGSRC74:1;
    };
  };
} ADTRIG4BITS;
extern volatile ADTRIG4BITS ADTRIG4bits __attribute__((__sfr__));

#define ADTRIG5 ADTRIG5
extern volatile unsigned int  ADTRIG5 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG5BITS {
  union {
    struct {
      unsigned TRGSRC8:5;
      unsigned :3;
      unsigned TRGSRC9:5;
    };
    struct {
      unsigned TRGSRC80:1;
      unsigned TRGSRC81:1;
      unsigned TRGSRC82:1;
      unsigned TRGSRC83:1;
      unsigned TRGSRC84:1;
      unsigned :3;
      unsigned TRGSRC90:1;
      unsigned TRGSRC91:1;
      unsigned TRGSRC92:1;
      unsigned TRIGSRC93:1;
      unsigned TRGSRC94:1;
    };
  };
} ADTRIG5BITS;
extern volatile ADTRIG5BITS ADTRIG5bits __attribute__((__sfr__));

#define ADTRIG6 ADTRIG6
extern volatile unsigned int  ADTRIG6 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG6BITS {
  union {
    struct {
      unsigned TRGSRC10:5;
      unsigned :3;
      unsigned TRGSRC11:5;
    };
    struct {
      unsigned TRGSRC100:1;
      unsigned TRGSRC101:1;
      unsigned TRGSRC102:1;
      unsigned TRGSRC103:1;
      unsigned TRGSRC104:1;
      unsigned :3;
      unsigned TRGSRC110:1;
      unsigned TRGSRC111:1;
      unsigned TRGSRC112:1;
      unsigned TRGSRC113:1;
      unsigned TRGSRC114:1;
    };
  };
} ADTRIG6BITS;
extern volatile ADTRIG6BITS ADTRIG6bits __attribute__((__sfr__));

#define ADTRIG7 ADTRIG7
extern volatile unsigned int  ADTRIG7 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG7BITS {
  union {
    struct {
      unsigned TRGSRC12:5;
    };
    struct {
      unsigned TRGSRC120:1;
      unsigned TRGSRC121:1;
      unsigned TRGSRC122:1;
      unsigned TRGSRC123:1;
      unsigned TRGSRC124:1;
    };
  };
} ADTRIG7BITS;
extern volatile ADTRIG7BITS ADTRIG7bits __attribute__((__sfr__));

