Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP16GS504.h
/* DCMP1ENH */
/* Bitname _CMPEN17 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN18 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN19 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN20 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN21 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN22 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN23 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN24 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN25 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN26 cannot be defined because it is used by more than one SFR */

/* DCMP2ENL */
/* Bitname _CMPEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN7 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN8 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN9 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN10 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN11 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN12 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN14 cannot be defined because it is used by more than one SFR */

/* DCMP2ENH */
/* Bitname _CMPEN17 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN18 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN19 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN20 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN21 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN22 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN23 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN24 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN25 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN26 cannot be defined because it is used by more than one SFR */

/* ADFLTR1CON */
/* Bitname _CHNLID cannot be defined because it is used by more than one SFR */
/* Bitname _AFRDY cannot be defined because it is used by more than one SFR */
/* Bitname _AFGIEN cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM cannot be defined because it is used by more than one SFR */
/* Bitname _AFEN cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID4 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID5 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM2 cannot be defined because it is used by more than one SFR */

/* ADFLTR2CON */
/* Bitname _CHNLID cannot be defined because it is used by more than one SFR */
/* Bitname _AFRDY cannot be defined because it is used by more than one SFR */
/* Bitname _AFGIEN cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM cannot be defined because it is used by more than one SFR */
/* Bitname _AFEN cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID4 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNLID5 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OVRSAM2 cannot be defined because it is used by more than one SFR */

/* ADTRIG1 */
#define _TRGSRC0 ADTRIG1bits.TRGSRC0
#define _TRGSRC1 ADTRIG1bits.TRGSRC1
#define _TRGSRC00 ADTRIG1bits.TRGSRC00
#define _TRGSRC01 ADTRIG1bits.TRGSRC01
#define _TRGSRC02 ADTRIG1bits.TRGSRC02
#define _TRGSRC03 ADTRIG1bits.TRGSRC03
#define _TRGSRC04 ADTRIG1bits.TRGSRC04
/* Bitname _TRGSRC10 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC11 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC12 cannot be defined because it is used by more than one SFR */
#define _TRGSRC13 ADTRIG1bits.TRGSRC13
/* Bitname _TRGSRC14 cannot be defined because it is used by more than one SFR */

/* ADTRIG2 */
#define _TRGSRC2 ADTRIG2bits.TRGSRC2
#define _TRGSRC3 ADTRIG2bits.TRGSRC3
/* Bitname _TRGSRC20 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC21 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC22 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC23 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC24 cannot be defined because it is used by more than one SFR */
#define _TRGSRC30 ADTRIG2bits.TRGSRC30
#define _TRGSRC31 ADTRIG2bits.TRGSRC31
#define _TRGSRC32 ADTRIG2bits.TRGSRC32
#define _TRGSRC33 ADTRIG2bits.TRGSRC33
#define _TRGSRC34 ADTRIG2bits.TRGSRC34

