Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP16GS504.h
/* RPOR17 */
#define _RP178R RPOR17bits.RP178R
#define _RP179R RPOR17bits.RP179R
#define _RP178R0 RPOR17bits.RP178R0
#define _RP178R1 RPOR17bits.RP178R1
#define _RP178R2 RPOR17bits.RP178R2
#define _RP178R3 RPOR17bits.RP178R3
#define _RP178R4 RPOR17bits.RP178R4
#define _RP178R5 RPOR17bits.RP178R5
#define _RP179R0 RPOR17bits.RP179R0
#define _RP179R1 RPOR17bits.RP179R1
#define _RP179R2 RPOR17bits.RP179R2
#define _RP179R3 RPOR17bits.RP179R3
#define _RP179R4 RPOR17bits.RP179R4
#define _RP179R5 RPOR17bits.RP179R5

/* RPOR18 */
#define _RP180R RPOR18bits.RP180R
#define _RP181R RPOR18bits.RP181R
#define _RP180R0 RPOR18bits.RP180R0
#define _RP180R1 RPOR18bits.RP180R1
#define _RP180R2 RPOR18bits.RP180R2
#define _RP180R3 RPOR18bits.RP180R3
#define _RP180R4 RPOR18bits.RP180R4
#define _RP180R5 RPOR18bits.RP180R5
#define _RP181R0 RPOR18bits.RP181R0
#define _RP181R1 RPOR18bits.RP181R1
#define _RP181R2 RPOR18bits.RP181R2
#define _RP181R3 RPOR18bits.RP181R3
#define _RP181R4 RPOR18bits.RP181R4
#define _RP181R5 RPOR18bits.RP181R5

/* RPINR0 */
#define _INT1R RPINR0bits.INT1R
#define _INT1R0 RPINR0bits.INT1R0
#define _INT1R1 RPINR0bits.INT1R1
#define _INT1R2 RPINR0bits.INT1R2
#define _INT1R3 RPINR0bits.INT1R3
#define _INT1R4 RPINR0bits.INT1R4
#define _INT1R5 RPINR0bits.INT1R5
#define _INT1R6 RPINR0bits.INT1R6
#define _INT1R7 RPINR0bits.INT1R7

/* RPINR1 */
#define _INT2R RPINR1bits.INT2R
#define _INT2R0 RPINR1bits.INT2R0
#define _INT2R1 RPINR1bits.INT2R1
#define _INT2R2 RPINR1bits.INT2R2
#define _INT2R3 RPINR1bits.INT2R3
#define _INT2R4 RPINR1bits.INT2R4
#define _INT2R5 RPINR1bits.INT2R5
#define _INT2R6 RPINR1bits.INT2R6
#define _INT2R7 RPINR1bits.INT2R7

/* RPINR2 */
#define _T1CKRR RPINR2bits.T1CKRR
#define _T1CKRR0 RPINR2bits.T1CKRR0
#define _T1CKRR1 RPINR2bits.T1CKRR1
#define _T1CKRR2 RPINR2bits.T1CKRR2
#define _T1CKRR3 RPINR2bits.T1CKRR3
#define _T1CKRR4 RPINR2bits.T1CKRR4
#define _T1CKRR5 RPINR2bits.T1CKRR5
#define _T1CKRR6 RPINR2bits.T1CKRR6
#define _T1CKRR7 RPINR2bits.T1CKRR7

/* RPINR3 */
#define _T2CKR RPINR3bits.T2CKR
#define _T3CKR RPINR3bits.T3CKR
#define _T2CKR0 RPINR3bits.T2CKR0
#define _T2CKR1 RPINR3bits.T2CKR1
#define _T2CKR2 RPINR3bits.T2CKR2
#define _T2CKR3 RPINR3bits.T2CKR3
#define _T2CKR4 RPINR3bits.T2CKR4
#define _T2CKR5 RPINR3bits.T2CKR5
#define _T2CKR6 RPINR3bits.T2CKR6
#define _T2CKR7 RPINR3bits.T2CKR7
#define _T3CKR0 RPINR3bits.T3CKR0
#define _T3CKR1 RPINR3bits.T3CKR1
#define _T3CKR2 RPINR3bits.T3CKR2
#define _T3CKR3 RPINR3bits.T3CKR3
#define _T3CKR4 RPINR3bits.T3CKR4
#define _T3CKR5 RPINR3bits.T3CKR5
#define _T3CKR6 RPINR3bits.T3CKR6
#define _T3CKR7 RPINR3bits.T3CKR7

/* RPINR7 */
#define _IC1R RPINR7bits.IC1R
#define _IC2R RPINR7bits.IC2R
#define _IC1R0 RPINR7bits.IC1R0
#define _IC1R1 RPINR7bits.IC1R1
#define _IC1R2 RPINR7bits.IC1R2
#define _IC1R3 RPINR7bits.IC1R3
#define _IC1R4 RPINR7bits.IC1R4
#define _IC1R5 RPINR7bits.IC1R5
#define _IC1R6 RPINR7bits.IC1R6
#define _IC1R7 RPINR7bits.IC1R7
#define _IC2R0 RPINR7bits.IC2R0
#define _IC2R1 RPINR7bits.IC2R1
#define _IC2R2 RPINR7bits.IC2R2
#define _IC2R3 RPINR7bits.IC2R3
#define _IC2R4 RPINR7bits.IC2R4
#define _IC2R5 RPINR7bits.IC2R5
#define _IC2R6 RPINR7bits.IC2R6
#define _IC2R7 RPINR7bits.IC2R7

/* RPINR8 */
#define _IC3R RPINR8bits.IC3R
#define _IC4R RPINR8bits.IC4R
#define _IC3R0 RPINR8bits.IC3R0
#define _IC3R1 RPINR8bits.IC3R1
#define _IC3R2 RPINR8bits.IC3R2
#define _IC3R3 RPINR8bits.IC3R3
#define _IC3R4 RPINR8bits.IC3R4
#define _IC3R5 RPINR8bits.IC3R5
#define _IC3R6 RPINR8bits.IC3R6
#define _IC3R7 RPINR8bits.IC3R7
#define _IC4R0 RPINR8bits.IC4R0
#define _IC4R1 RPINR8bits.IC4R1
#define _IC4R2 RPINR8bits.IC4R2
#define _IC4R3 RPINR8bits.IC4R3
#define _IC4R4 RPINR8bits.IC4R4
#define _IC4R5 RPINR8bits.IC4R5
#define _IC4R6 RPINR8bits.IC4R6
#define _IC4R7 RPINR8bits.IC4R7

/* RPINR11 */
#define _OCFAR RPINR11bits.OCFAR
#define _OCFAR0 RPINR11bits.OCFAR0
#define _OCFAR1 RPINR11bits.OCFAR1
#define _OCFAR2 RPINR11bits.OCFAR2
#define _OCFAR3 RPINR11bits.OCFAR3
#define _OCFAR4 RPINR11bits.OCFAR4
#define _OCFAR5 RPINR11bits.OCFAR5
#define _OCFAR6 RPINR11bits.OCFAR6
#define _OCFAR7 RPINR11bits.OCFAR7

/* RPINR12 */
#define _FLT1R RPINR12bits.FLT1R
#define _FLT2R RPINR12bits.FLT2R
#define _FLT1R0 RPINR12bits.FLT1R0
#define _FLT1R1 RPINR12bits.FLT1R1
#define _FLT1R2 RPINR12bits.FLT1R2
#define _FLT1R3 RPINR12bits.FLT1R3
#define _FLT1R4 RPINR12bits.FLT1R4
#define _FLT1R5 RPINR12bits.FLT1R5
#define _FLT1R6 RPINR12bits.FLT1R6
#define _FLT1R7 RPINR12bits.FLT1R7
#define _FLT2R0 RPINR12bits.FLT2R0
#define _FLT2R1 RPINR12bits.FLT2R1
#define _FLT2R2 RPINR12bits.FLT2R2
#define _FLT2R3 RPINR12bits.FLT2R3
#define _FLT2R4 RPINR12bits.FLT2R4
#define _FLT2R5 RPINR12bits.FLT2R5
#define _FLT2R6 RPINR12bits.FLT2R6
#define _FLT2R7 RPINR12bits.FLT2R7

/* RPINR13 */
#define _FLT3R RPINR13bits.FLT3R
#define _FLT4R RPINR13bits.FLT4R
#define _FLT3R0 RPINR13bits.FLT3R0
#define _FLT3R1 RPINR13bits.FLT3R1
#define _FLT3R2 RPINR13bits.FLT3R2
#define _FLT3R3 RPINR13bits.FLT3R3
#define _FLT3R4 RPINR13bits.FLT3R4
#define _FLT3R5 RPINR13bits.FLT3R5
#define _FLT3R6 RPINR13bits.FLT3R6
#define _FLT3R7 RPINR13bits.FLT3R7
#define _FLT4R0 RPINR13bits.FLT4R0
#define _FLT4R1 RPINR13bits.FLT4R1
#define _FLT4R2 RPINR13bits.FLT4R2
#define _FLT4R3 RPINR13bits.FLT4R3
#define _FLT4R4 RPINR13bits.FLT4R4
#define _FLT4R5 RPINR13bits.FLT4R5
#define _FLT4R6 RPINR13bits.FLT4R6
#define _FLT4R7 RPINR13bits.FLT4R7

/* RPINR18 */
#define _U1RXR RPINR18bits.U1RXR
#define _U1CTSR RPINR18bits.U1CTSR
#define _U1RXR0 RPINR18bits.U1RXR0
#define _U1RXR1 RPINR18bits.U1RXR1
#define _U1RXR2 RPINR18bits.U1RXR2
#define _U1RXR3 RPINR18bits.U1RXR3
#define _U1RXR4 RPINR18bits.U1RXR4
#define _U1RXR5 RPINR18bits.U1RXR5
#define _U1RXR6 RPINR18bits.U1RXR6
#define _U1RXR7 RPINR18bits.U1RXR7
#define _U1CTSR0 RPINR18bits.U1CTSR0
#define _U1CTSR1 RPINR18bits.U1CTSR1
#define _U1CTSR2 RPINR18bits.U1CTSR2
#define _U1CTSR3 RPINR18bits.U1CTSR3
#define _U1CTSR4 RPINR18bits.U1CTSR4
#define _U1CTSR5 RPINR18bits.U1CTSR5
#define _U1CTSR6 RPINR18bits.U1CTSR6
#define _U1CTSR7 RPINR18bits.U1CTSR7

/* RPINR19 */
#define _U2RXR RPINR19bits.U2RXR
#define _U2CTSR RPINR19bits.U2CTSR
#define _U2RXR0 RPINR19bits.U2RXR0
#define _U2RXR1 RPINR19bits.U2RXR1
#define _U2RXR2 RPINR19bits.U2RXR2
#define _U2RXR3 RPINR19bits.U2RXR3
#define _U2RXR4 RPINR19bits.U2RXR4
#define _U2RXR5 RPINR19bits.U2RXR5
#define _U2RXR6 RPINR19bits.U2RXR6
#define _U2RXR7 RPINR19bits.U2RXR7
#define _U2CTSR0 RPINR19bits.U2CTSR0
#define _U2CTSR1 RPINR19bits.U2CTSR1
#define _U2CTSR2 RPINR19bits.U2CTSR2
#define _U2CTSR3 RPINR19bits.U2CTSR3
#define _U2CTSR4 RPINR19bits.U2CTSR4
#define _U2CTSR5 RPINR19bits.U2CTSR5
#define _U2CTSR6 RPINR19bits.U2CTSR6
#define _U2CTSR7 RPINR19bits.U2CTSR7

/* RPINR20 */
#define _SDI1R RPINR20bits.SDI1R
#define _SCK1INR RPINR20bits.SCK1INR
#define _SDI1R0 RPINR20bits.SDI1R0
#define _SDI1R1 RPINR20bits.SDI1R1
#define _SDI1R2 RPINR20bits.SDI1R2
#define _SDI1R3 RPINR20bits.SDI1R3
#define _SDI1R4 RPINR20bits.SDI1R4
#define _SDI1R5 RPINR20bits.SDI1R5
#define _SDI1R6 RPINR20bits.SDI1R6
#define _SDI1R7 RPINR20bits.SDI1R7
#define _SCK1INR0 RPINR20bits.SCK1INR0
#define _SCK1INR1 RPINR20bits.SCK1INR1
#define _SCK1INR2 RPINR20bits.SCK1INR2
#define _SCK1INR3 RPINR20bits.SCK1INR3
#define _SCK1INR4 RPINR20bits.SCK1INR4
#define _SCK1INR5 RPINR20bits.SCK1INR5
#define _SCK1INR6 RPINR20bits.SCK1INR6
#define _SCK1INR7 RPINR20bits.SCK1INR7

/* RPINR21 */
#define _SS1R RPINR21bits.SS1R
#define _SS1R0 RPINR21bits.SS1R0
#define _SS1R1 RPINR21bits.SS1R1
#define _SS1R2 RPINR21bits.SS1R2
#define _SS1R3 RPINR21bits.SS1R3
#define _SS1R4 RPINR21bits.SS1R4
#define _SS1R5 RPINR21bits.SS1R5
#define _SS1R6 RPINR21bits.SS1R6
#define _SS1R7 RPINR21bits.SS1R7

