Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP16GS504.h
#define _DCMP2ENL_CMPEN0_POSITION                0x00000000
#define _DCMP2ENL_CMPEN0_MASK                    0x00000001
#define _DCMP2ENL_CMPEN0_LENGTH                  0x00000001

#define _DCMP2ENL_CMPEN1_POSITION                0x00000001
#define _DCMP2ENL_CMPEN1_MASK                    0x00000002
#define _DCMP2ENL_CMPEN1_LENGTH                  0x00000001

#define _DCMP2ENL_CMPEN2_POSITION                0x00000002
#define _DCMP2ENL_CMPEN2_MASK                    0x00000004
#define _DCMP2ENL_CMPEN2_LENGTH                  0x00000001

#define _DCMP2ENL_CMPEN3_POSITION                0x00000003
#define _DCMP2ENL_CMPEN3_MASK                    0x00000008
#define _DCMP2ENL_CMPEN3_LENGTH                  0x00000001

#define _DCMP2ENL_CMPEN4_POSITION                0x00000004
#define _DCMP2ENL_CMPEN4_MASK                    0x00000010
#define _DCMP2ENL_CMPEN4_LENGTH                  0x00000001

#define _DCMP2ENL_CMPEN5_POSITION                0x00000005
#define _DCMP2ENL_CMPEN5_MASK                    0x00000020
#define _DCMP2ENL_CMPEN5_LENGTH                  0x00000001

#define _DCMP2ENL_CMPEN6_POSITION                0x00000006
#define _DCMP2ENL_CMPEN6_MASK                    0x00000040
#define _DCMP2ENL_CMPEN6_LENGTH                  0x00000001

#define _DCMP2ENL_CMPEN7_POSITION                0x00000007
#define _DCMP2ENL_CMPEN7_MASK                    0x00000080
#define _DCMP2ENL_CMPEN7_LENGTH                  0x00000001

#define _DCMP2ENL_CMPEN8_POSITION                0x00000008
#define _DCMP2ENL_CMPEN8_MASK                    0x00000100
#define _DCMP2ENL_CMPEN8_LENGTH                  0x00000001

#define _DCMP2ENL_CMPEN9_POSITION                0x00000009
#define _DCMP2ENL_CMPEN9_MASK                    0x00000200
#define _DCMP2ENL_CMPEN9_LENGTH                  0x00000001

#define _DCMP2ENL_CMPEN10_POSITION               0x0000000A
#define _DCMP2ENL_CMPEN10_MASK                   0x00000400
#define _DCMP2ENL_CMPEN10_LENGTH                 0x00000001

#define _DCMP2ENL_CMPEN11_POSITION               0x0000000B
#define _DCMP2ENL_CMPEN11_MASK                   0x00000800
#define _DCMP2ENL_CMPEN11_LENGTH                 0x00000001

#define _DCMP2ENL_CMPEN12_POSITION               0x0000000C
#define _DCMP2ENL_CMPEN12_MASK                   0x00001000
#define _DCMP2ENL_CMPEN12_LENGTH                 0x00000001

#define _DCMP2ENL_CMPEN14_POSITION               0x0000000E
#define _DCMP2ENL_CMPEN14_MASK                   0x00004000
#define _DCMP2ENL_CMPEN14_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN17_POSITION               0x00000001
#define _DCMP2ENH_CMPEN17_MASK                   0x00000002
#define _DCMP2ENH_CMPEN17_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN18_POSITION               0x00000002
#define _DCMP2ENH_CMPEN18_MASK                   0x00000004
#define _DCMP2ENH_CMPEN18_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN19_POSITION               0x00000003
#define _DCMP2ENH_CMPEN19_MASK                   0x00000008
#define _DCMP2ENH_CMPEN19_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN20_POSITION               0x00000004
#define _DCMP2ENH_CMPEN20_MASK                   0x00000010
#define _DCMP2ENH_CMPEN20_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN21_POSITION               0x00000005
#define _DCMP2ENH_CMPEN21_MASK                   0x00000020
#define _DCMP2ENH_CMPEN21_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN22_POSITION               0x00000006
#define _DCMP2ENH_CMPEN22_MASK                   0x00000040
#define _DCMP2ENH_CMPEN22_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN23_POSITION               0x00000007
#define _DCMP2ENH_CMPEN23_MASK                   0x00000080
#define _DCMP2ENH_CMPEN23_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN24_POSITION               0x00000008
#define _DCMP2ENH_CMPEN24_MASK                   0x00000100
#define _DCMP2ENH_CMPEN24_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN25_POSITION               0x00000009
#define _DCMP2ENH_CMPEN25_MASK                   0x00000200
#define _DCMP2ENH_CMPEN25_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN26_POSITION               0x0000000A
#define _DCMP2ENH_CMPEN26_MASK                   0x00000400
#define _DCMP2ENH_CMPEN26_LENGTH                 0x00000001

#define _ADFLTR1CON_CHNLID_POSITION              0x00000000
#define _ADFLTR1CON_CHNLID_MASK                  0x0000003F
#define _ADFLTR1CON_CHNLID_LENGTH                0x00000006

#define _ADFLTR1CON_AFRDY_POSITION               0x00000008
#define _ADFLTR1CON_AFRDY_MASK                   0x00000100
#define _ADFLTR1CON_AFRDY_LENGTH                 0x00000001

#define _ADFLTR1CON_AFGIEN_POSITION              0x00000009
#define _ADFLTR1CON_AFGIEN_MASK                  0x00000200
#define _ADFLTR1CON_AFGIEN_LENGTH                0x00000001

#define _ADFLTR1CON_OVRSAM_POSITION              0x0000000A
#define _ADFLTR1CON_OVRSAM_MASK                  0x00001C00
#define _ADFLTR1CON_OVRSAM_LENGTH                0x00000003

#define _ADFLTR1CON_AFEN_POSITION                0x0000000F
#define _ADFLTR1CON_AFEN_MASK                    0x00008000
#define _ADFLTR1CON_AFEN_LENGTH                  0x00000001

#define _ADFLTR1CON_CHNLID0_POSITION             0x00000000
#define _ADFLTR1CON_CHNLID0_MASK                 0x00000001
#define _ADFLTR1CON_CHNLID0_LENGTH               0x00000001

#define _ADFLTR1CON_CHNLID1_POSITION             0x00000001
#define _ADFLTR1CON_CHNLID1_MASK                 0x00000002
#define _ADFLTR1CON_CHNLID1_LENGTH               0x00000001

#define _ADFLTR1CON_CHNLID2_POSITION             0x00000002
#define _ADFLTR1CON_CHNLID2_MASK                 0x00000004
#define _ADFLTR1CON_CHNLID2_LENGTH               0x00000001

#define _ADFLTR1CON_CHNLID3_POSITION             0x00000003
#define _ADFLTR1CON_CHNLID3_MASK                 0x00000008
#define _ADFLTR1CON_CHNLID3_LENGTH               0x00000001

#define _ADFLTR1CON_CHNLID4_POSITION             0x00000004
#define _ADFLTR1CON_CHNLID4_MASK                 0x00000010
#define _ADFLTR1CON_CHNLID4_LENGTH               0x00000001

#define _ADFLTR1CON_CHNLID5_POSITION             0x00000005
#define _ADFLTR1CON_CHNLID5_MASK                 0x00000020
#define _ADFLTR1CON_CHNLID5_LENGTH               0x00000001

#define _ADFLTR1CON_OVRSAM0_POSITION             0x0000000A
#define _ADFLTR1CON_OVRSAM0_MASK                 0x00000400
#define _ADFLTR1CON_OVRSAM0_LENGTH               0x00000001

