Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP16GS504.h
#define _IPC39_ADCAN14IP0_POSITION               0x00000004
#define _IPC39_ADCAN14IP0_MASK                   0x00000010
#define _IPC39_ADCAN14IP0_LENGTH                 0x00000001

#define _IPC39_ADCAN14IP1_POSITION               0x00000005
#define _IPC39_ADCAN14IP1_MASK                   0x00000020
#define _IPC39_ADCAN14IP1_LENGTH                 0x00000001

#define _IPC39_ADCAN14IP2_POSITION               0x00000006
#define _IPC39_ADCAN14IP2_MASK                   0x00000040
#define _IPC39_ADCAN14IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN17IP_POSITION                0x00000000
#define _IPC40_ADCAN17IP_MASK                    0x00000007
#define _IPC40_ADCAN17IP_LENGTH                  0x00000003

#define _IPC40_ADCAN18IP_POSITION                0x00000004
#define _IPC40_ADCAN18IP_MASK                    0x00000070
#define _IPC40_ADCAN18IP_LENGTH                  0x00000003

#define _IPC40_ADCAN19IP_POSITION                0x00000008
#define _IPC40_ADCAN19IP_MASK                    0x00000700
#define _IPC40_ADCAN19IP_LENGTH                  0x00000003

#define _IPC40_ADCAN20IP_POSITION                0x0000000C
#define _IPC40_ADCAN20IP_MASK                    0x00007000
#define _IPC40_ADCAN20IP_LENGTH                  0x00000003

#define _IPC40_ADCAN17IP0_POSITION               0x00000000
#define _IPC40_ADCAN17IP0_MASK                   0x00000001
#define _IPC40_ADCAN17IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN17IP1_POSITION               0x00000001
#define _IPC40_ADCAN17IP1_MASK                   0x00000002
#define _IPC40_ADCAN17IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN17IP2_POSITION               0x00000002
#define _IPC40_ADCAN17IP2_MASK                   0x00000004
#define _IPC40_ADCAN17IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN18IP0_POSITION               0x00000004
#define _IPC40_ADCAN18IP0_MASK                   0x00000010
#define _IPC40_ADCAN18IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN18IP1_POSITION               0x00000005
#define _IPC40_ADCAN18IP1_MASK                   0x00000020
#define _IPC40_ADCAN18IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN18IP2_POSITION               0x00000006
#define _IPC40_ADCAN18IP2_MASK                   0x00000040
#define _IPC40_ADCAN18IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN19IP0_POSITION               0x00000008
#define _IPC40_ADCAN19IP0_MASK                   0x00000100
#define _IPC40_ADCAN19IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN19IP1_POSITION               0x00000009
#define _IPC40_ADCAN19IP1_MASK                   0x00000200
#define _IPC40_ADCAN19IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN19IP2_POSITION               0x0000000A
#define _IPC40_ADCAN19IP2_MASK                   0x00000400
#define _IPC40_ADCAN19IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN20IP0_POSITION               0x0000000C
#define _IPC40_ADCAN20IP0_MASK                   0x00001000
#define _IPC40_ADCAN20IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN20IP1_POSITION               0x0000000D
#define _IPC40_ADCAN20IP1_MASK                   0x00002000
#define _IPC40_ADCAN20IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN20IP2_POSITION               0x0000000E
#define _IPC40_ADCAN20IP2_MASK                   0x00004000
#define _IPC40_ADCAN20IP2_LENGTH                 0x00000001

#define _IPC41_ADCAN21IP_POSITION                0x00000000
#define _IPC41_ADCAN21IP_MASK                    0x00000007
#define _IPC41_ADCAN21IP_LENGTH                  0x00000003

#define _IPC41_ADCAN22IP_POSITION                0x00000004
#define _IPC41_ADCAN22IP_MASK                    0x00000070
#define _IPC41_ADCAN22IP_LENGTH                  0x00000003

#define _IPC41_ADCAN23IP_POSITION                0x00000008
#define _IPC41_ADCAN23IP_MASK                    0x00000700
#define _IPC41_ADCAN23IP_LENGTH                  0x00000003

#define _IPC41_ADCAN24IP_POSITION                0x0000000C
#define _IPC41_ADCAN24IP_MASK                    0x00007000
#define _IPC41_ADCAN24IP_LENGTH                  0x00000003

#define _IPC41_ADCAN21IP0_POSITION               0x00000000
#define _IPC41_ADCAN21IP0_MASK                   0x00000001
#define _IPC41_ADCAN21IP0_LENGTH                 0x00000001

#define _IPC41_ADCAN21IP1_POSITION               0x00000001
#define _IPC41_ADCAN21IP1_MASK                   0x00000002
#define _IPC41_ADCAN21IP1_LENGTH                 0x00000001

#define _IPC41_ADCAN21IP2_POSITION               0x00000002
#define _IPC41_ADCAN21IP2_MASK                   0x00000004
#define _IPC41_ADCAN21IP2_LENGTH                 0x00000001

#define _IPC41_ADCAN22IP0_POSITION               0x00000004
#define _IPC41_ADCAN22IP0_MASK                   0x00000010
#define _IPC41_ADCAN22IP0_LENGTH                 0x00000001

#define _IPC41_ADCAN22IP1_POSITION               0x00000005
#define _IPC41_ADCAN22IP1_MASK                   0x00000020
#define _IPC41_ADCAN22IP1_LENGTH                 0x00000001

#define _IPC41_ADCAN22IP2_POSITION               0x00000006
#define _IPC41_ADCAN22IP2_MASK                   0x00000040
#define _IPC41_ADCAN22IP2_LENGTH                 0x00000001

#define _IPC41_ADCAN23IP0_POSITION               0x00000008
#define _IPC41_ADCAN23IP0_MASK                   0x00000100
#define _IPC41_ADCAN23IP0_LENGTH                 0x00000001

#define _IPC41_ADCAN23IP1_POSITION               0x00000009
#define _IPC41_ADCAN23IP1_MASK                   0x00000200
#define _IPC41_ADCAN23IP1_LENGTH                 0x00000001

#define _IPC41_ADCAN23IP2_POSITION               0x0000000A
#define _IPC41_ADCAN23IP2_MASK                   0x00000400
#define _IPC41_ADCAN23IP2_LENGTH                 0x00000001

#define _IPC41_ADCAN24IP0_POSITION               0x0000000C
#define _IPC41_ADCAN24IP0_MASK                   0x00001000
#define _IPC41_ADCAN24IP0_LENGTH                 0x00000001

#define _IPC41_ADCAN24IP1_POSITION               0x0000000D
#define _IPC41_ADCAN24IP1_MASK                   0x00002000
#define _IPC41_ADCAN24IP1_LENGTH                 0x00000001

